Repository: perlancar/perl-Perinci-To-Doc
Catalog: po/*.po
Languages: id

source: Examples
id: Contoh

source: Pass -reverse=>1 to reverse operation.
id: Berikan -reverse=>1 untuk operasi reverse.

source: To undo, pass -undo_action=>'undo' to function. You will also need to pass -undo_data. For more details on undo protocol, see L<Rinci::Undo>.
id: Untuk undo, berikan -undo_action=>'undo' pada fungsi. Anda juga perlu memberikan -undo_data. Untuk detil tentang protokol undo, lihat L<Rinci::Undo>.

source: Required if you pass -undo_action=>'undo'. For more details on undo protocol, see L<Rinci::function::Undo>.
id: Diperlukan jika Anda memberikan -undo_action=>'undo'. Untuk detail tentang protokol undo, lihat L<Rinci::function::Undo>.

source: Pass -dry_run=>1 to enable simulation mode.
id: Berikan -dry_run=>1 untuk menghidupkan mode simulasi.

source: This function is pure (produce no side effects).
id: Fungsi ini murni (pure, tidak menghasilkan efek samping).

source: This function is immutable (returns same result for same arguments).
id: Fungsi ini bersifat imutabel (immutable, mengembalikan hasil yang sama untuk argumen yang sama).

source: This function is idempotent (repeated invocations with same arguments has the same effect as single invocation).
id: Fungsi ini bersifat idempoten (idempotent, pemanggilan berulang kali dengan argumen yang sama efeknya seperti pemanggilan sekali).

source: For more information on transaction, see L<Rinci::Transaction>.
id: Untuk informasi lebih lanjut tentang transaksi, lihat L<Rinci::Transaction>.

source: Arguments
id: Argumen

source: '*' denotes required arguments
id: '*' menandakan argumen wajib

source: default
id: bawaan

source: Return value
id: Nilai kembali

source: This function dies on error.
id: Fungsi ini die() jika menemui kesalahan.

source: Name
id: Nama

source: Version
id: Versi

source: Description
id: Deskripsi

source: Functions
id: Fungsi
